# Curso Pandas - IA Expert Academy

### Comandos necessários ao curso
- instalação das bibliotecas: Pandas, Numpy e Faker;
- importação dos módulos das bibliotecas citadas.
- leitura do arquivo csv usado no curso ('census.csv')

Para usar o notebook com a serie `serie_idade_nome` execute as proximas linhas de código e garanta que o aruivo `census.csv` foi carregado à plataforma.

In [3]:
!pip install pandas
!pip install numpy
!pip install Faker

Requirement already satisfied: pandas in c:\users\gusta\appdata\roaming\python\python312\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\gusta\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\gusta\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\gusta\appdata\roaming\python\python312\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\gusta\appdata\roaming\python\python312\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\gusta\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: numpy in c:\users\gusta\anaconda3\lib\site-packages (1.26.4)
Collecting Faker
  Downloading Faker-36.1.1-py3-none-any.whl.metadata (15 kB)
Requirement already satisfied: tzdata in c:\users\gusta\appdata\roaming\python\python312\site-packages (from Faker) (2025.1)
Downloading Faker-36.1.1-py3-none-any.whl (1.9 MB)
   ---------------------------------------- 0.0/1.9 MB ? eta -:--:--
   ---------------------------------------- 1.9/1.9 MB 17.6 MB/s eta 0:00:00
Installing collected packages: Faker
Successfully installed Faker-36.1.1

In [4]:
from faker import Faker
import pandas as pd
import numpy as np

faker = Faker()

Para criar uma Serie de países, com valores do tipo string:

In [ ]:
country_index = [faker.country() for _ in range(32561)]

In [ ]:
serie_pais = pd.Series(country_index)

Antes de executar a proxima linha, faça o upload de `census.csv`

In [5]:
dataset_census = pd.read_csv('./datasets/census.csv')

Para criar uma Serie de idades onde os valores são do tipo numérico:

In [ ]:
serie_idades = pd.Series(np.array(dataset_census['age']))

## Acessando Elementos com LOC

#### Introdução
O `loc` é um método de acessar os elementos através dos indices sendo esses, strings. Ao acessar um indice com o loc, o retorno será seu valor -- no caso desse exemplo, a idade.

O comando abaixo retorna a idade de "Mr. Paul Mitchell".

In [ ]:
serie_idades_nome.loc['Mr. Paul Mitchell']

É possível, assim como fazemos com indices por números (iloc), retornar valores num determinado intervalo. Mas, como nesse caso são strings, podem haver duplicatas e isso retornará um erro.
Para usar o retorno de intervalos com loc é preciso eliminar duplicatas antes, usando `drop_duplicates()` e criado uma nova série.

In [ ]:
serie_idades_nomeII = serie_idades_nome.drop_duplicates()

In [ ]:
serie_idades_nomeII

Kyle Valdez          39
Mr. Paul Mitchell    50
Leslie Stanton       38
Marcus Campbell      53
Christie Perkins     28
                     ..
Michael Lambert      83
James Beltran        84
Daniel Brennan       85
William Hughes       86
Kayla Rodriguez      87
Length: 73, dtype: int64

In [ ]:
serie_idades_nomeII.loc["Leslie Stanton":"Michael Lambert"]

Leslie Stanton      38
Marcus Campbell     53
Christie Perkins    28
Lori Hernandez      37
Desiree Novak       49
                    ..
Paul Hogan          81
Rebecca Johnson     78
Sally Mason         88
Michael Matthews    82
Michael Lambert     83
Length: 67, dtype: int64

## Ordenação (Series)

Series, sendo compostas por duas colunas, uma de valor e outra de indice, podem ser ordenadas usando `sort_values()` e `sort_index()`

In [ ]:
serie_idades_nomeII = serie_idades_nome.drop_duplicates()

In [ ]:
serie_idades_nomeII.sort_values()

In [ ]:
serie_idades_nomeII.sort_index()

É possível alterar a forma de organizar os registros de forma ascentente ou descendente usando o parâmetro `ascending` que pode assumir dois valores `True` ou `Falso` de modo que o padrão é True e, um `ascending = False` torna o retorno descendente.

In [ ]:
serie_idades_nomeII.sort_values(ascending = False)

Blake Adkins           90
Joshua Allison         88
Alexandria Campbell    87
Elizabeth Clark        86
Damon Martinez         85
                       ..
Erik Herrera           21
Lori Butler            20
Stephanie Oneal        19
Amy Haynes             18
Michael Ward           17
Length: 73, dtype: int64

Usando ordenação e iloc é possível, por exemplo, retornar os 15 registros de maiores valores (como no caso do exemplo os registros são idades, retorna-se as 15 maiores idades na Serie).

In [ ]:
serie_15_idades = serie_idades_nomeII.sort_values(ascending = False).iloc[:15]

In [ ]:
serie_15_idades.size

15

## Contagem (Series)

#### Método size

Usando `Serie.size` temos como retorno o número de registro na Serie

In [ ]:
serie_pais.size

32561

#### Método value_count
Esse método agrupa os tipos diferentes de valores e dá suas quantidades. Ex: como estamos usando uma Serie de países, ele agrupara os países e retornará quantas vezes cada um aparece.

In [ ]:
serie_pais.value_counts()

Korea                           253
Congo                           244
Poland                          168
Cayman Islands                  161
Svalbard & Jan Mayen Islands    158
                               ...
Solomon Islands                 109
Swaziland                       108
Tajikistan                      107
Bhutan                          105
Armenia                         101
Name: count, Length: 243, dtype: int64

Por padrão, o método retorna os elementos de forma ordenada de forma decrescentem, mas é possível desativar isso com o parâmetro Serie.value_counts(`sort = False`)

In [ ]:
serie_pais.value_counts(sort = False)

Azerbaijan      128
Iceland         134
Uruguay         124
Liberia         141
Hungary         132
               ...
Eritrea         133
Sierra Leone    138
Yemen           136
Saudi Arabia    131
Ecuador         131
Name: count, Length: 243, dtype: int64

Passando alguns parâmetros nesse método podemos alterar a forma que ele retorna os respectivos valores.
O parâmetro Serie.value_counts(`normalize = True`) faz com que os valores dos elementos sejam apresentados em *porcentagens do todo*.

In [ ]:
serie_pais.value_counts(normalize = True)

Korea                           0.007770
Congo                           0.007494
Poland                          0.005160
Cayman Islands                  0.004945
Svalbard & Jan Mayen Islands    0.004852
                                  ...
Solomon Islands                 0.003348
Swaziland                       0.003317
Tajikistan                      0.003286
Bhutan                          0.003225
Armenia                         0.003102
Name: proportion, Length: 243, dtype: float64

O parâmetro Serie.value_counts(`bins = x`) torna o retorno dividido no número de vezes específicadas em x. Mas para o método funcionar, os valores da Serie têm de ser do tipo **numérico**.

O retorno será semelhante a uma *tabela de frequências* onde os índices serão os intervalos dos elementos numéricos e os valores da Serie, a quantidade de elementos naquele intervalo.

In [ ]:
serie_idades.value_counts(bins = 10)

(38.9, 46.2]      6163
(31.6, 38.9]      6048
(24.3, 31.6]      5890
(16.926, 24.3]    5570
(46.2, 53.5]      3967
(53.5, 60.8]      2591
(60.8, 68.1]      1595
(68.1, 75.4]       496
(75.4, 82.7]       174
(82.7, 90.0]        67
Name: count, dtype: int64

## Filtragem (Series)

Para começar, use países como indices ao invés de nomes, pois isso tornará mais simples o processo.

Abaixo é gerado a lista de paises usando o método `faker.country()`

In [ ]:
countries_index = [faker.country() for _ in range(32561)]

Definindo uma Serie de idades e países (valor = idades; indices = países)

In [ ]:
serie_idade_pais = pd.Series(np.array(dataset['age']), index = countries_index)

O comando abaixo filtra os países onde o valor é maior que um número x (x = 57)

In [ ]:
serie_idade_pais[serie_idade_pais > 57]

É possível combinar condicionais, retornando registros que satisfaçam uma condição e (&) outra

In [ ]:
serie_idade_pais.loc[(serie_idade_pais > 57) & (serie_idade_pais.index == "Italy")].size

17

Usando `Serie.index.isin()` pode-se varrer a Serie e retornar True ou False para cada registro de acordo se correspondem ou não aos elementos passados como parâmetro

In [ ]:
serie_idade_pais.index.isin(["Italy", "Brazil"])

array([False, False, False, ..., False, False, False])

Ao adicionar um " ~ " no início do comando inverte-se a condicional, retornando True aos que não satisfazem os parâmetros

In [ ]:
~serie_idade_pais.index.isin(["China", "Boznia", "India"])

array([ True,  True,  True, ...,  True,  True,  True])

## Operações Matemáticas

As operações matemáticas em Series recaem em seus valores o que quer dizer que, ao fazer uma operação qualquer numa Serie, seus valores é que são alterados.
É possível fazer as mesmas 4 operações cada uma de duas formas diferentes, uma sendo nativa do Python e a outra sendo do Pandas. Abaixo estão mostrados as formas sendo a primeira do Python e a segunda do Pandas:

Serie original para comparação:

In [ ]:
serie_idade_pais

Kiribati            39
Djibouti            50
Andorra             38
Oman                53
Kiribati            28
                    ..
China               27
Ireland             40
Christmas Island    58
Myanmar             22
Bhutan              52
Length: 32561, dtype: int64

### Soma

Ao efetuar `Serie + x` será retornada a Serie com os valores adicionados x:

In [ ]:
serie_idade_pais + 2

Kiribati            41
Djibouti            52
Andorra             40
Oman                55
Kiribati            30
                    ..
China               29
Ireland             42
Christmas Island    60
Myanmar             24
Bhutan              54
Length: 32561, dtype: int64

Também é possível somar usando o método: `Serie.add(x)`

In [ ]:
serie_idade_pais.add(2)

### Subtração

In [ ]:
serie_idade_pais - 2

In [ ]:
serie_idade_pais.sub(2)

### Multiplicação

In [ ]:
serie_idade_pais * 2

Kiribati             78
Djibouti            100
Andorra              76
Oman                106
Kiribati             56
                   ...
China                54
Ireland              80
Christmas Island    116
Myanmar              44
Bhutan              104
Length: 32561, dtype: int64

### Divisão

In [ ]:
serie_idade_pais / 2

Kiribati            19.5
Djibouti            25.0
Andorra             19.0
Oman                26.5
Kiribati            14.0
                    ...
China               13.5
Ireland             20.0
Christmas Island    29.0
Myanmar             11.0
Bhutan              26.0
Length: 32561, dtype: float64

In [ ]:
serie_idade_pais.div(2)

Kiribati            19.5
Djibouti            25.0
Andorra             19.0
Oman                26.5
Kiribati            14.0
                    ...
China               13.5
Ireland             20.0
Christmas Island    29.0
Myanmar             11.0
Bhutan              26.0
Length: 32561, dtype: float64

### Operações com Series

In [ ]:
serie_1 = pd.Series([1, 2, 3])
serie_2 = pd.Series([10, 20, 30])
serie_1, serie_2

(0    1
 1    2
 2    3
 dtype: int64,
 0    10
 1    20
 2    30
 dtype: int64)

#### Adição

In [ ]:
serie_1.add(serie_2)

In [ ]:
serie_1 + serie_2

0    11
1    22
2    33
dtype: int64

#### Subtração

In [ ]:
serie_1.sub(serie_2)

0    -9
1   -18
2   -27
dtype: int64

In [ ]:
serie_1 - serie_2

#### Multiplicação

In [ ]:
serie_1.mul(serie_2)

In [ ]:
serie_1 * serie_2

#### Divisão

In [ ]:
serie_1.div(serie_2)

In [ ]:
serie_1 / serie_2

## Operações com Strings

A Serie `serie_idade_pais` é composta por índices do tipo String e valores do tipo numérico.
Para realizar as operações precisamos que os valores sejam Strings então vamos fazer essa mudança:

O método `Serie.index.to_series()` cria uma Serie onde seus valores são os índices da Serie original. Nesse caso estamos chamando ela na serie_idade_pais então o resultado será: transformar os valores de idades para os nomes dos países.

In [ ]:
serie_idade_pais = serie_idade_pais.index.to_series()

O próximo passo é resetar os índices para valores numéricos, resultado numa Serie de 32.561 países:

In [ ]:
serie_idade_pais.reset_index(drop = True, inplace = True)

### Operações

#### Busca na Serie

Use `Serie.str.contains("<string>")` para varrer a Serie e retornar True ou False para a presença da string passada no parâmetro dentro dos valores da Serie. (A String pode ser completa ou só um trecho).

In [ ]:
serie_idade_pais.str.contains("nma")

0        False
1        False
2        False
3        False
4        False
         ...
32556    False
32557    False
32558    False
32559     True
32560    False
Length: 32561, dtype: bool

#### Transformação em maiusculas e minúsculas

É possível transformar todos os valores em maíusculas ou minúsculas usando, respectivamente `Serie.str.upper()` ou `Serie.str.lower()`.

In [ ]:
serie_idade_pais.str.upper()

0                KIRIBATI
1                DJIBOUTI
2                 ANDORRA
3                    OMAN
4                KIRIBATI
               ...
32556               CHINA
32557             IRELAND
32558    CHRISTMAS ISLAND
32559             MYANMAR
32560              BHUTAN
Length: 32561, dtype: object

In [ ]:
serie_idade_pais.str.lower()

0                kiribati
1                djibouti
2                 andorra
3                    oman
4                kiribati
               ...
32556               china
32557             ireland
32558    christmas island
32559             myanmar
32560              bhutan
Length: 32561, dtype: object

#### Removendo uma String

Pode-se remover uma palavra específica de todos os registros ao passá-la como parâmetro no comando `Serie.str.strip("<String>")`.

In [ ]:
serie_idade_pais.str.strip("Christmas")

0          Kirib
1         Djibou
2           Ando
3           Oman
4          Kirib
          ...
32556          n
32557    Ireland
32558     Island
32559       Myan
32560     Bhutan
Length: 32561, dtype: object

#### Quebrando Palavras com split (e adicionando novas colunas)

Com o método `Serie.str.split()` pode-se separar palavras em um determinado ponto que definimos em seu parâmetro.
Passando também o parâmetro `expand = True` pode-se expandir a Serie, criando novas colunas que os pedaços da string armazenará.

In [ ]:
serie_idade_pais.str.split(" ", expand = True)

               0       1     2     3     4     5     6     7
0       Kiribati    None  None  None  None  None  None  None
1       Djibouti    None  None  None  None  None  None  None
2        Andorra    None  None  None  None  None  None  None
3           Oman    None  None  None  None  None  None  None
4       Kiribati    None  None  None  None  None  None  None
...          ...     ...   ...   ...   ...   ...   ...   ...
32556      China    None  None  None  None  None  None  None
32557    Ireland    None  None  None  None  None  None  None
32558  Christmas  Island  None  None  None  None  None  None
32559    Myanmar    None  None  None  None  None  None  None
32560     Bhutan    None  None  None  None  None  None  None

[32561 rows x 8 columns]

#### Acessando posições específicas das Strings

Usando o slicing é possível retornar uma parte específica de todas as strings da Serie

In [ ]:
serie_idade_pais.str[0:5]

## Agrupamento Numérico

#### Somando todos os valores
Numa Serie com valores numéricos, é possível obter a soma de todos os valores com o método `Serie.sum()`

In [ ]:
serie_idades_nome.sum()

1256257

#### Obtendo a Média de todos os valores
Com o comando `Serie.mean()` se tem a média de todos os valores numéricos da Serie.

In [ ]:
serie_idades_nome.mean()

38.58164675532078

#### Obtendo a mediana

Mediana é o valor do meio de uma sequência e para conseguir esse valor com Series, use `Serie.median()`.

In [ ]:
serie_idades_nome.median()

37.0

#### Contando número de valores na Serie
Usando `Serie.count()` se têm o número de elementos na Serie. Basicamente o número de registros que se têm ao usar Serie.size.

In [ ]:
serie_idades_nome.count()

32561

#### Desvio padrão

Essa é uma medida que diz, basicamente, o quanto um conjunto de valores está espalhado comparado à média, quanto mais próximo de zero mais uniforme serão os valores e quanto mais longe, mais espalhados serão.
Para conseguir o desvio padrão de uma Serie use `Serie.std()`.

In [ ]:
serie_idades_nome.std()

13.640432553581146

#### Variância

Essa medida expressa o quanto os valores de um conjunto variam em relação à média deste.

In [ ]:
serie_idades_nome.var()

186.06140024879625

#### Combinando Filtragem e os comandos

É possível filtrar os dados para só depois usar essas operações, por exemplo, a média dos valores do conjunto onde o país é "Japão":

In [ ]:
serie_idade_pais.loc["Japan"].mean()

38.333333333333336

Ou a soma dos valores onde o país é "Turquia".

In [ ]:
serie_idade_pais.loc["Turkey"].sum()

4353

#### Retornando "cortes" da Serie

Usando o comando `Serie.quantile([x1, x2, ..., xn])` é possível acessar valores que estejam em pedaços definidos na Serie. Esse comando organiza os dados de forma crescente e retorna um valor para cada parâmetro definido (em porcentage), por exemplo, se a Serie tem 10 registros e passarmos 0.30 (30%) o comando retornará o 3° valor. Caso se passe o valor 0.50 (50%) ele retorna a mediana que é o valor que está no meio da Serie.

In [ ]:
serie_idade_pais.quantile([0.25,0.5])

0.25    28.0
0.50    37.0
dtype: float64

## Agrupamento Categórico

Para trabalhar com esse tipo de agrupamento, usamos uma Serie em que os **indices** são valores padrões (0, 1, 2, ..., n) e os **valores** serão os países.

#### Contando Valores
O comando `value_counts()` retorna a quantidade de valores que correspondem a cada grupo, ou seja, numa Serie de países, retornará quantas vezes aparece "Japão", "Coréia", "Irã", etc. O retorno é feito em forma de Serie.

In [ ]:
serie_idade_pais.value_counts()

Korea           260
Congo           241
South Africa    164
Ecuador         162
Jordan          161
               ...
Turkey          110
Fiji            109
Azerbaijan      108
Tajikistan      106
Liberia         104
Name: count, Length: 243, dtype: int64

Usando o parâmetro `normalize = True` dentro de value_counts() os valores são retornados em forma de porcentagem.

In [ ]:
serie_idade_pais.value_counts(normalize = True)

Korea           0.007985
Congo           0.007401
South Africa    0.005037
Ecuador         0.004975
Jordan          0.004945
                  ...
Turkey          0.003378
Fiji            0.003348
Azerbaijan      0.003317
Tajikistan      0.003255
Liberia         0.003194
Name: proportion, Length: 243, dtype: float64

#### Retornando Categorias Únicas

Com o comando `Serie.unique()` teremos o retorno de um array com os valores únicos que aparecem na Serie.

In [ ]:
serie_idade_pais.unique()

array(['Kiribati', 'Djibouti', 'Andorra', 'Oman', 'Mauritius', 'Yemen',
       'Moldova', 'Tunisia', 'Guinea', 'Cocos (Keeling) Islands',
       'Swaziland', 'Hungary', 'Burkina Faso', 'Montserrat', 'Tonga',
       'Serbia', 'Nauru', 'Zambia', 'Croatia', 'French Polynesia',
       'Mongolia', 'Liechtenstein', 'Chad', 'Norfolk Island', 'Mayotte',
       'Saint Vincent and the Grenadines', 'Nigeria', 'Taiwan', 'Aruba',
       'Norway', 'Faroe Islands', 'Latvia', 'Saint Helena', 'Canada',
       'Ecuador', 'Ireland', 'France', 'Niger', 'Myanmar', 'Guernsey',
       'Cyprus', 'Ghana', 'French Guiana', 'Grenada',
       'French Southern Territories', 'Jordan', 'Lesotho', 'Togo',
       'Tuvalu', 'New Caledonia', 'Somalia', 'Zimbabwe', 'Rwanda',
       'Pitcairn Islands', 'Korea', 'Albania', 'El Salvador',
       'Seychelles', 'Panama', 'Bermuda', 'Equatorial Guinea',
       'Saint Martin', 'Solomon Islands', 'San Marino', 'Peru', 'Romania',
       'South Africa', 'Costa Rica', 'Czech Republic',
       'Falkland Islands (Malvinas)', 'United States Virgin Islands',
       'Guyana', 'Bahamas', 'Malta', 'Nepal', 'Netherlands Antilles',
       'Slovakia (Slovak Republic)', 'Vietnam', 'Venezuela',
       'American Samoa', 'United States Minor Outlying Islands',
       'Mauritania', 'South Georgia and the South Sandwich Islands',
       'Mali', 'Mexico', 'Dominica', 'Guinea-Bissau', 'United Kingdom',
       'Chile', 'Luxembourg', 'Malaysia', 'Botswana', 'Guam',
       'Bangladesh', 'Liberia', 'Ukraine', 'Morocco', 'Brazil', 'Palau',
       'Palestinian Territory', 'Macao', 'Spain', 'Tokelau', 'Guadeloupe',
       'Bahrain', 'Trinidad and Tobago', 'Antigua and Barbuda',
       'Hong Kong', 'Puerto Rico', 'Samoa', 'Papua New Guinea', 'Gabon',
       'Portugal', 'Greece', 'North Macedonia', 'Georgia',
       "Lao People's Democratic Republic", 'Australia', 'Guatemala',
       'Lebanon', 'Fiji', 'Monaco', 'Heard Island and McDonald Islands',
       'Iceland', 'Reunion', 'Vanuatu', 'Maldives', 'Cook Islands',
       'Germany', 'Austria', 'Senegal', 'Congo', 'Japan', 'Israel',
       'Netherlands', 'Eritrea', 'Niue', 'Namibia', 'Martinique',
       'Svalbard & Jan Mayen Islands', 'Suriname',
       'United States of America', 'Italy', 'Dominican Republic',
       'Greenland', 'Nicaragua', 'India', 'Saint Barthelemy',
       'Central African Republic', 'Egypt', 'Russian Federation',
       'Burundi', 'Brunei Darussalam', 'Azerbaijan', 'Cape Verde', 'Iran',
       'Colombia', 'Antarctica (the territory South of 60 deg S)',
       'Bolivia', 'Barbados', 'Micronesia', 'Sierra Leone', 'Kenya',
       'Cayman Islands', 'Philippines', 'Saint Pierre and Miquelon',
       'Saint Lucia', 'China', 'New Zealand', 'Kazakhstan', 'Cambodia',
       'Bosnia and Herzegovina', 'Holy See (Vatican City State)',
       'Marshall Islands', 'Algeria', 'Benin', 'Sudan',
       'Saint Kitts and Nevis', 'Sweden', 'Belgium', 'Montenegro',
       'Gambia', 'Comoros', 'Mozambique', 'Switzerland', 'Iraq', 'Turkey',
       'Afghanistan', 'Indonesia', "Cote d'Ivoire", 'Estonia',
       'Syrian Arab Republic', 'Madagascar', 'Kuwait', 'Poland',
       'British Indian Ocean Territory (Chagos Archipelago)',
       'Uzbekistan', 'Wallis and Futuna', 'Paraguay', 'Western Sahara',
       'Tanzania', 'Saudi Arabia', 'Tajikistan', 'Cuba', 'Singapore',
       'Bhutan', 'Armenia', 'Argentina', 'Turks and Caicos Islands',
       'Kyrgyz Republic', 'Cameroon', 'Anguilla', 'Jersey', 'Gibraltar',
       'Lithuania', 'Bulgaria', 'Sao Tome and Principe', 'Thailand',
       'Libyan Arab Jamahiriya', 'Honduras', 'Jamaica', 'Malawi',
       'Belize', 'Uganda', 'United Arab Emirates', 'Sri Lanka',
       'Turkmenistan', 'Qatar', 'Denmark', 'Belarus', 'Haiti',
       'Bouvet Island (Bouvetoya)', 'British Virgin Islands', 'Uruguay',
       'Timor-Leste', 'Ethiopia', 'Pakistan', 'Finland',
       'Christmas Island', 'Slovenia', 'Northern Mariana Islands',
       'Angola', 'Isle of Man'], dtype=object)

#### Retornando a quantidade de Elementos Únicos

Pode-se saber quantos valores distintos estão na Serie através do comando `Serie.nunique()`

In [ ]:
serie_idade_pais.nunique()

243

## Valores Faltantes

Primeiro, criamos uma Serie com os valores faltantes

In [ ]:
serie_faltante = pd.Series([1, 2, 3, 4, np.nan, 5, np.nan])

serie_faltante

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    5.0
6    NaN
dtype: float64

#### Identificando e Contando os valores faltantes

Com o método `Serie.isna()` é possível identificar através de True ou False, se os elementos da Serie em questão são NaN ou não

In [ ]:
serie_faltante.isna()

0    False
1    False
2    False
3    False
4     True
5    False
6     True
dtype: bool

Caso queiramos saber *quantos* são os valores faltantes, basta adicionar `.sum()` ao comando Serie.isna()

In [ ]:
serie_faltante.isna().sum()

2

Outra forma de contabilizar os valores NaN é com o uso do parâmetro **dropna = False** no método `Serie.value_counts()`, dessa forma será retornado uma Serie com a quantidade de cada valor e os valores NaN terão seu número exibido.

In [ ]:
serie_faltante.value_counts(dropna = False)

NaN    2
1.0    1
2.0    1
3.0    1
4.0    1
5.0    1
Name: count, dtype: int64

### Maneiras de Corrigir Valores Faltantes *em Series Numéricas*

#### Preenchimento

Consiste em substituir esses valores por qualquer outro. Isso é feito usando a função `Serie.fillna(x)` x = valor que substituirá NaN.

Aqui os valores são preenchidos por zero (0):

In [ ]:
serie_faltante.fillna(0)

0    1.0
1    2.0
2    3.0
3    4.0
4    0.0
5    5.0
6    0.0
dtype: float64

O modo mais comum e considerado correto de tratar os valores faltantes é **preenche-los com a média**:

In [ ]:
serie_faltante.fillna(serie_faltante.mean())

0    1.0
1    2.0
2    3.0
3    4.0
4    3.0
5    5.0
6    3.0
dtype: float64

#### Apagando linhas com NaN

Outra forma de corrigir tal problema é literalmente apagar as linhas cujo valor é NaN por meio do comando `Serie.dropna()`, mas essa maneira não é muito aconselhável uma vez que faz com que se perca valores da database.

In [ ]:
serie_faltante.dropna()

0    1.0
1    2.0
2    3.0
3    4.0
5    5.0
dtype: float64

### Maneiras de Corrigir Valores Faltantes *em Series Categóricas*

In [ ]:
serie_faltante_str = pd.Series(["Maçã", "Banana", "Arroz", "Arroz", np.nan, "Batata"])
serie_faltante_str

0      Maçã
1    Banana
2     Arroz
3     Arroz
4       NaN
5    Batata
dtype: object

#### Preenchimento

Uma forma de lidar com valores faltantes nessa situação é preenchê-lo com um valor que não existe na database

In [ ]:
serie_faltante.fillna("Não contém")

0           1.0
1           2.0
2           3.0
3           4.0
4    Não contém
5           5.0
6    Não contém
dtype: object

Outra forma de preencher os valores é usando a moda (valor mais recorrente da base de dados) e isso é feito usando o comando `Serie.mode().loc[0]` uma vez que o comando retorna uma Serie cujo elemento é a moda, passamos esse comando nos parâmetros de **fillan()**

In [ ]:
serie_faltante_str.fillna(serie_faltante_str.mode().loc[0])

0      Maçã
1    Banana
2     Arroz
3     Arroz
4     Arroz
5    Batata
dtype: object

## Funções

Suponha uma base de dados onde há algumas pessoas com idade menor que 18 e precisamos converter todas essas para 18.

In [ ]:
serie_idades.loc[serie_idades < 18]

106      17
209      17
262      17
271      17
335      17
         ..
31772    17
31864    17
31959    17
32282    17
32447    17
Length: 395, dtype: int64

#### Usando Funções Comuns

Nessa situação, podemos usar uma função que será passada pela base de dados e converterá toda idade menor que 18 para 18

In [ ]:
def fix_age(age):
  if age < 18: age = 18
  return age

Para fazer tal coisa, existe um método do Pandas cuja funcionalidade é exatamente aplicar uma função para todas as linhas da base de dados e a sintaxe é: `Serie.apply(<function>)`.
Esse método devolve uma segunda Serie então é preciso salvar esse retorno em algum lugar nem que seja a Serie na qual ela é chamada

In [ ]:
serie_idades = serie_idades.apply(fix_age)

Caso o mesmo filtro de antes seja aplicado, ele não retornará nada pois não haverá nenhum registro menor que 18

In [ ]:
serie_idades.loc[serie_idades < 18]

Series([], dtype: int64)

#### Usando Lambda

Outra forma de abordar tal problemática é fazendo uso de funções anônimas, construíndo a função dentro do parâmetro do apply ao invés de construí-la fora e passar seu nome.
*O comando abaixo transforma todas as idades que são 18 em 17, para cada registro na base de dados.*

In [ ]:
serie_idades = serie_idades.apply(lambda x: 17 if x == 18 else x)

#### Comando Where
O pandas fornece um comando para efetuar uma operação em determinados registros que não satisfazem uma condição, o where: `Serie.where(<Conditional>, x)` para os registros que retornarem False à condição, seus valores passarão a ser x.

In [ ]:
serie_idadeII = serie_idades.iloc[0:10]
serie_idadeII

0    39
1    50
2    38
3    53
4    28
5    37
6    49
7    52
8    31
9    42
dtype: int64

No código abaixo: todos os valores que forem *maiores* que 30 (que retoram False à condicional), seu novo valor passará a ser zero

In [ ]:
serie_idadeII.where(serie_idadeII < 30, 0)

0     0
1     0
2     0
3     0
4    28
5     0
6     0
7     0
8     0
9     0
dtype: int64

In [ ]:
serie_idadeII

0    39
1    50
2    38
3    53
4    28
5    37
6    49
7    52
8    31
9    42
dtype: int64